Repository: eliotk/bwp_minify_plugin
Catalog: languages/bwp-minify-*.po
Languages: ro_ro

source: %s requires WordPress <strong>%s</strong> or higher and PHP <strong>%s</strong> or higher. The plugin will not function until you update your software. Please deactivate this plugin.
ro_ro: %s necesita versiunea de Wordpress <strong>%s</strong> sau mai mare si PHP <strong>%s</strong> sau mai mare. Plugin-ul nu va functiona pana nu actualizati programele. Va rugam dezactivati plugin-ul.

source: You are using version %s!
ro_ro: Folosesti versiunea %s!

source: Settings
ro_ro: Setari

source: Better WordPress Minify Settings
ro_ro: Setari Better WordPress Minify

source: You do not have sufficient permissions to access this page.
ro_ro: Nu aveti permisiuni suficiente pentru a accesa aceasta pagina!

source: General Options
ro_ro: Optiuni generale

source: Minify CSS, JS files automatically?
ro_ro: Fa compresie pentru fisierele CSS, JS automat?

source: Minify <code>bloginfo()</code> stylesheets?
ro_ro: Fa compresie la stylesheet-urile <code>bloginfo()</code>?

source: Minifying Options
ro_ro: Optiuni de compresie

source: Minify URL (double-click to edit)
ro_ro: Compresie URL (faceti dublu clic pentru a edita)

source: Cache will be stored in (by default)
ro_ro: Cache-ul va fi stocat in

source: One minify string will contain
ro_ro: Un string minify (de compresie) va contine

source: Append the minify string with
ro_ro: Adauga string-ului

source: Minifying Scripts Options
ro_ro: Optiuni de script Minify

source: Scripts to be minified in header
ro_ro: Scripturi de comprimat in header

source: Scripts to be minified in footer
ro_ro: Scripturi de comprimat in footer

source: Scripts to be minified and then printed separately
ro_ro: Scripturi de comprimat si imprimate separate

source: Scripts to be ignored (not minified)
ro_ro: Scripturi de ignorat (nu vor fi comprimate)

source: <em>Options that affect both your stylesheets and scripts.</em>
ro_ro: <em>Optiuni care afecteaza scripturile si stylesheet-urile.</em>

source: <em>You can force the position of each script using those inputs below (e.g. you have a script registered in the header but you want to minify it in the footer instead). If you are still unsure, please read more <a href="%s#positioning-your-scripts">here</a>. Type in one script handle (<strong>NOT filename</strong>) per line.</em>
ro_ro: <em>Puteti forta pozitia fiecarui script folosind datele de mai jos (ex. aveti un script in header dar vreti sa il comprimati in footer). Pentru mai multe informatii accesati pagina de <a href="%s#positioning-your-scripts">aici</a>. Introduceti o comanda (<strong>NU nume de fisier</strong>) pe linie.</em>

source: second(s)
ro_ro: secunda(-e)

source: minute(s)
ro_ro: minut(-e)

source: hour(s)
ro_ro: ora(-e)

source: day(s)
ro_ro: zi(le)

source: Do not append anything
ro_ro: Nu adauga nimic

source: Cache folder&#8217;s last modified time
ro_ro: Folder deCache &#8217;s modificat ultima data

source: Your WordPress&#8217;s current version
ro_ro: Versiunea curenta de WordPress&#8217;s

source: A custom number
ro_ro: Un numar personalizat

source: you can still use the template function <code>bwp_minify()</code> if you disable this.
ro_ro: puteti folosi in continuare functia de template function <code>bwp_minify()</code> daca dezactivati.

source: most themes (e.g. Twenty Ten) use <code>bloginfo()</code> to print the main stylesheet (i.e. <code>style.css</code>) and BWP Minify will not be able to add it to the main minify string. If you want to minify <code>style.css</code> with the rest of your css files, you must enqueue it.
ro_ro: majoritatea temelor (ex. Twenty Ten) folosesc <code>bloginfo()</code> pentru a genera stylesheet-ul principal (i.e. <code>style.css</code>) iar BWP Minify nu va putea sa il adauge la string-ul primar. Daca doriti sa comprimati <code>style.css</code> cu celelalte fisiere css, trebuie sa il adaugati in sir.

source: This should be set automatically. If you think the URL is too long, please read <a href="%s#customization">here</a> to know how to properly modify this.
ro_ro: Ar trebui setat automat. Daca credeti ca URL-ul este prea lung, va rugam cititi <a href="%s#customization">aici</a> pentru a afla cum puteti modifica aceasta functie

source: The cache directory must be writable (i.e. CHMOD to 755 or 777).
ro_ro: Directorul de cache trebuie sa fie writable (CHMOD setat la 755 sau 777).

source: file(s) at most.
ro_ro: fisier(e) maxim.

source: <em><strong>Note:</strong> When you append one of the things above you are basically telling browsers to clear their cached version of your CSS and JS files, which is very useful when you change source files. Use this feature wisely :).</em>
ro_ro: <em><strong>Nota:</strong> Cand adaugati unul dintre lucrurile de mai sus, le spuneti browserelor sa curete versiunea din cache a fisierelor CSS si JS, un lucru util pentru atunci cand schimbati sursa fisierelor. Folositi functia cu atentie :).</em>

source: Warning
ro_ro: Avertisment

source: Cache directory does not exist or is not writable. Please try CHMOD your cache directory to 755. If you still see this warning, CHMOD to 777.
ro_ro: Directorul de cache nu exista sau nu este writable. Va rugam schimbati CHMOD pentru acest director la 755. Daca eroarea persista, schimbati la 777.

source: empty
ro_ro: gol

source: Plugin Configurations
ro_ro: Configurarea plugin-ului

source: Save Changes
ro_ro: Salveaza schimbarile
